RT-Thread/rt-thread/bsp/hc32f4a0/Libraries/HC32F4A0_StdPeriph_Driver/src/hc32f4a0_mpu.c
/**
 *******************************************************************************
 * @file  hc32f4a0_mpu.c
 * @brief This file provides firmware functions to manage the Memory Protection
 *        Unit(MPU).
 @verbatim
   Change Logs:
   Date             Author          Notes
   2020-06-12       Yangjp          First version
 @endverbatim
 *******************************************************************************
 * Copyright (C) 2020, Huada Semiconductor Co., Ltd. All rights reserved.
 *
 * This software component is licensed by HDSC under BSD 3-Clause license
 * (the "License"); You may not use this file except in compliance with the
 * License. You may obtain a copy of the License at:
 *                    opensource.org/licenses/BSD-3-Clause
 *
 *******************************************************************************
 */

/*******************************************************************************
 * Include files
 ******************************************************************************/
#include "hc32f4a0_mpu.h"
#include "hc32f4a0_utility.h"

/**
 * @addtogroup HC32F4A0_DDL_Driver
 * @{
 */

/**
 * @defgroup DDL_MPU MPU
 * @brief Memory Protection Unit Driver Library
 * @{
 */

#if (DDL_MPU_ENABLE == DDL_ON)

/*******************************************************************************
 * Local type definitions ('typedef')
 ******************************************************************************/

/*******************************************************************************
 * Local pre-processor symbols/macros ('#define')
 ******************************************************************************/
/**
 * @defgroup MPU_Local_Macros MPU Local Macros
 * @{
 */

/* Number of MPU unit */
#define MPU_UNIT_NUM                    (5UL)
/* Number of MPU region */
#define MPU_REGION_NUM                  (16UL)

/* MPU Register Combination Mask */
#define MPU_UNIT_CONFIG_MASK            (MPU_S1CR_SMPU1BRP  | MPU_S1CR_SMPU1BWP  | MPU_S1CR_SMPU1ACT)

/* DMA units with only 8 regions */
#define MPU_NORMAL_UNIT                 (MPU_UNIT_USBFS_DMA | MPU_UNIT_USBHS_DMA | MPU_UNIT_ETH_DMA)

/* Get the specified register address of the MPU Intrusion Control */
#define MPU_RGD(__NUM__)                ((uint32_t)(&(M4_MPU->RGD0))   + ((uint32_t)(__NUM__) << 2U))

#define MPU_RGE(__UNIT__)               ((uint32_t)(&(M4_MPU->S1RGE))  + (uint32_t)(__UNIT__))
#define MPU_RGWP(__UNIT__)              ((uint32_t)(&(M4_MPU->S1RGWP)) + (uint32_t)(__UNIT__))
#define MPU_RGRP(__UNIT__)              ((uint32_t)(&(M4_MPU->S1RGRP)) + (uint32_t)(__UNIT__))
#define MPU_CR(__UNIT__)                ((uint32_t)(&(M4_MPU->S1CR))   + (uint32_t)(__UNIT__))

/**
 * @defgroup MPU_Check_Parameters_Validity MPU Check Parameters Validity
 * @{
 */
#define IS_MPU_UNIT(x)                                                         \
(   ((x) != 0UL)                                &&                             \
    (((x) | MPU_UNIT_ALL) == MPU_UNIT_ALL))

#define IS_MPU_REGION(x)                                                       \
(   ((x) == MPU_REGION_NUM0)                    ||                             \
    ((x) == MPU_REGION_NUM1)                    ||                             \
    ((x) == MPU_REGION_NUM2)                    ||                             \
    ((x) == MPU_REGION_NUM3)                    ||                             \
    ((x) == MPU_REGION_NUM4)                    ||                             \
    ((x) == MPU_REGION_NUM5)                    ||                             \
    ((x) == MPU_REGION_NUM6)                    ||                             \
    ((x) == MPU_REGION_NUM7)                    ||                             \
    ((x) == MPU_REGION_NUM8)                    ||                             \
    ((x) == MPU_REGION_NUM9)                    ||                             \
    ((x) == MPU_REGION_NUM10)                   ||                             \
    ((x) == MPU_REGION_NUM11)                   ||                             \
    ((x) == MPU_REGION_NUM12)                   ||                             \
    ((x) == MPU_REGION_NUM13)                   ||                             \
    ((x) == MPU_REGION_NUM14)                   ||                             \
    ((x) == MPU_REGION_NUM15))

#define IS_MPU_UNIT_REGION(unit, region)                                       \
(   (((unit) & MPU_NORMAL_UNIT) == 0UL)         ||                             \
    (((region) == MPU_REGION_NUM0) ||                                          \
     ((region) == MPU_REGION_NUM1) ||                                          \
     ((region) == MPU_REGION_NUM2) ||                                          \
     ((region) == MPU_REGION_NUM3) ||                                          \
     ((region) == MPU_REGION_NUM4) ||                                          \
     ((region) == MPU_REGION_NUM5) ||                                          \
     ((region) == MPU_REGION_NUM6) ||                                          \
     ((region) == MPU_REGION_NUM7)))

#define IS_MPU_BKGRD_WR_PROTECT(x)                                             \
(   ((x) == MPU_BKGRD_WR_PROTECT_DISABLE)       ||                             \
    ((x) == MPU_BKGRD_WR_PROTECT_ENABLE))

#define IS_MPU_BKGRD_RD_PROTECT(x)                                             \
(   ((x) == MPU_BKGRD_RD_PROTECT_DISABLE)       ||                             \
    ((x) == MPU_BKGRD_RD_PROTECT_ENABLE))

#define IS_MPU_EXP_TYPE(x)                                                     \
(   ((x) == MPU_EXP_TYPE_NONE)                  ||                             \
    ((x) == MPU_EXP_TYPE_BUS_ERR)               ||                             \
    ((x) == MPU_EXP_TYPE_NMI)                   ||                             \
    ((x) == MPU_EXP_TYPE_RST))

#define IS_MPU_REGION_WR_PROTECT(x)                                            \
(   ((x) == MPU_REGION_WR_PROTECT_DISABLE)      ||                             \
    ((x) == MPU_REGION_WR_PROTECT_ENABLE))

#define IS_MPU_REGION_RD_PROTECT(x)                                            \
(   ((x) == MPU_REGION_RD_PROTECT_DISABLE)      ||                             \
    ((x) == MPU_REGION_RD_PROTECT_ENABLE))

