RT-Thread/rt-thread/bsp/hc32f4a0/Libraries/HC32F4A0_StdPeriph_Driver/src/hc32f4a0_mpu.c
#define IS_MPU_REGION_SIZE(x)                                                  \
(   ((x) == MPU_REGION_SIZE_32BYTE)             ||                             \
    ((x) == MPU_REGION_SIZE_64BYTE)             ||                             \
    ((x) == MPU_REGION_SIZE_128BYTE)            ||                             \
    ((x) == MPU_REGION_SIZE_256BYTE)            ||                             \
    ((x) == MPU_REGION_SIZE_512BYTE)            ||                             \
    ((x) == MPU_REGION_SIZE_1KBYTE)             ||                             \
    ((x) == MPU_REGION_SIZE_2KBYTE)             ||                             \
    ((x) == MPU_REGION_SIZE_4KBYTE)             ||                             \
    ((x) == MPU_REGION_SIZE_8KBYTE)             ||                             \
    ((x) == MPU_REGION_SIZE_16KBYTE)            ||                             \
    ((x) == MPU_REGION_SIZE_32KBYTE)            ||                             \
    ((x) == MPU_REGION_SIZE_64KBYTE)            ||                             \
    ((x) == MPU_REGION_SIZE_128KBYTE)           ||                             \
    ((x) == MPU_REGION_SIZE_256KBYTE)           ||                             \
    ((x) == MPU_REGION_SIZE_512KBYTE)           ||                             \
    ((x) == MPU_REGION_SIZE_1MBYTE)             ||                             \
    ((x) == MPU_REGION_SIZE_2MBYTE)             ||                             \
    ((x) == MPU_REGION_SIZE_4MBYTE)             ||                             \
    ((x) == MPU_REGION_SIZE_8MBYTE)             ||                             \
    ((x) == MPU_REGION_SIZE_16MBYTE)            ||                             \
    ((x) == MPU_REGION_SIZE_32MBYTE)            ||                             \
    ((x) == MPU_REGION_SIZE_64MBYTE)            ||                             \
    ((x) == MPU_REGION_SIZE_128MBYTE)           ||                             \
    ((x) == MPU_REGION_SIZE_256MBYTE)           ||                             \
    ((x) == MPU_REGION_SIZE_512MBYTE)           ||                             \
    ((x) == MPU_REGION_SIZE_1GBYTE)             ||                             \
    ((x) == MPU_REGION_SIZE_2GBYTE)             ||                             \
    ((x) == MPU_REGION_SIZE_4GBYTE))

#define IS_MPU_REGION_BASE_ADDER(addr, size)                                   \
(   ((addr) & ((uint32_t)(~((uint64_t)0xFFFFFFFFUL << ((size) + 1U))))) == 0UL)

#define IS_MPU_FLAG(x)                                                         \
(   ((x) != 0UL)                                &&                             \
    (((x) | MPU_FLAG_ALL) == MPU_FLAG_ALL))

#define IS_MPU_IP_TYPE(x)                                                      \
(   ((x) != 0UL)                                &&                             \
    (((x) | MPU_IP_ALL) == MPU_IP_ALL))

#define IS_MPU_IP_EXP_TYPE(x)                                                  \
(   ((x) == MPU_IP_EXP_TYPE_NONE)               ||                             \
    ((x) == MPU_IP_EXP_TYPE_BUS_ERR))

#define IS_MPU_UNLOCK()             ((M4_MPU->WP & MPU_WP_MPUWE) == MPU_WP_MPUWE)

/**
 * @}
 */

/**
 * @}
 */

/*******************************************************************************
 * Global variable definitions (declared in header file with 'extern')
 ******************************************************************************/

/*******************************************************************************
 * Local function prototypes ('static')
 ******************************************************************************/

/*******************************************************************************
 * Local variable definitions ('static')
 ******************************************************************************/

/*******************************************************************************
 * Function implementation - global ('extern') and local ('static')
 ******************************************************************************/
/**
 * @defgroup MPU_Global_Functions MPU Global Functions
 * @{
 */

/**
 * @brief  De-Initialize MPU.
 * @param  None
 * @retval None
 */
void MPU_DeInit(void)
{
    uint32_t i;
    __IO uint32_t *RGD;
    __IO uint32_t *RGE;
    __IO uint32_t *RGWP;
    __IO uint32_t *RGRP;
    __IO uint32_t *CR;

    /* Check parameters */
    DDL_ASSERT(IS_MPU_UNLOCK());

    for (i = 0UL; i < MPU_REGION_NUM; i++)
    {
        RGD = (__IO uint32_t *)MPU_RGD(i);
        WRITE_REG32(*RGD, 0UL);
    }
    WRITE_REG32(M4_MPU->ECLR, 0x1FUL);
    WRITE_REG32(M4_MPU->IPPR, 0UL);
    for (i = 0UL; i < MPU_UNIT_NUM; i++)
    {
        RGE = (__IO uint32_t *)MPU_RGE(i << 4);
        WRITE_REG32(*RGE, 0UL);
        RGWP = (__IO uint32_t *)MPU_RGWP(i << 4);
        WRITE_REG32(*RGWP, 0UL);
        RGRP = (__IO uint32_t *)MPU_RGRP(i << 4);
        WRITE_REG32(*RGRP, 0UL);
        CR = (__IO uint32_t *)MPU_CR(i << 4);
        WRITE_REG32(*CR, 0UL);
    }
}

/**
 * @brief  Initialize MPU.
 * @param  [in] pstcMpuInit             Pointer to a @ref stc_mpu_init_t structure
 * @retval An en_result_t enumeration value:
 *           - Ok: Initialize success
 *           - ErrorInvalidParameter: Invalid parameter
 */
en_result_t MPU_Init(const stc_mpu_init_t *pstcMpuInit)
{
    en_result_t enRet = Ok;

    if (NULL == pstcMpuInit)
    {
        enRet = ErrorInvalidParameter;
    }
    else
    {
        /* Check parameters */
        DDL_ASSERT(IS_MPU_UNLOCK());
        DDL_ASSERT(IS_MPU_EXP_TYPE(pstcMpuInit->stcDma1.u32ExceptionType));
        DDL_ASSERT(IS_MPU_EXP_TYPE(pstcMpuInit->stcDma2.u32ExceptionType));
        DDL_ASSERT(IS_MPU_EXP_TYPE(pstcMpuInit->stcUsbFSDma.u32ExceptionType));
        DDL_ASSERT(IS_MPU_EXP_TYPE(pstcMpuInit->stcUsbHSDma.u32ExceptionType));
        DDL_ASSERT(IS_MPU_EXP_TYPE(pstcMpuInit->stcEthDma.u32ExceptionType));
        DDL_ASSERT(IS_MPU_BKGRD_WR_PROTECT(pstcMpuInit->stcDma1.u32BackgroundWriteProtect));
        DDL_ASSERT(IS_MPU_BKGRD_WR_PROTECT(pstcMpuInit->stcDma2.u32BackgroundWriteProtect));
        DDL_ASSERT(IS_MPU_BKGRD_WR_PROTECT(pstcMpuInit->stcUsbFSDma.u32BackgroundWriteProtect));
        DDL_ASSERT(IS_MPU_BKGRD_WR_PROTECT(pstcMpuInit->stcUsbHSDma.u32BackgroundWriteProtect));
        DDL_ASSERT(IS_MPU_BKGRD_WR_PROTECT(pstcMpuInit->stcEthDma.u32BackgroundWriteProtect));
        DDL_ASSERT(IS_MPU_BKGRD_RD_PROTECT(pstcMpuInit->stcDma1.u32BackgroundReadProtect));
        DDL_ASSERT(IS_MPU_BKGRD_RD_PROTECT(pstcMpuInit->stcDma2.u32BackgroundReadProtect));
        DDL_ASSERT(IS_MPU_BKGRD_RD_PROTECT(pstcMpuInit->stcUsbFSDma.u32BackgroundReadProtect));
        DDL_ASSERT(IS_MPU_BKGRD_RD_PROTECT(pstcMpuInit->stcUsbHSDma.u32BackgroundReadProtect));
        DDL_ASSERT(IS_MPU_BKGRD_RD_PROTECT(pstcMpuInit->stcEthDma.u32BackgroundReadProtect));

        MODIFY_REG32(M4_MPU->S1CR, MPU_UNIT_CONFIG_MASK,
                     (pstcMpuInit->stcDma1.u32ExceptionType              |
                      pstcMpuInit->stcDma1.u32BackgroundWriteProtect     | pstcMpuInit->stcDma1.u32BackgroundReadProtect));
        MODIFY_REG32(M4_MPU->S2CR, MPU_UNIT_CONFIG_MASK,
                     (pstcMpuInit->stcDma2.u32ExceptionType              |
                      pstcMpuInit->stcDma2.u32BackgroundWriteProtect     | pstcMpuInit->stcDma2.u32BackgroundReadProtect));
        MODIFY_REG32(M4_MPU->FCR, MPU_UNIT_CONFIG_MASK,
                     (pstcMpuInit->stcUsbFSDma.u32ExceptionType          |
                      pstcMpuInit->stcUsbFSDma.u32BackgroundWriteProtect | pstcMpuInit->stcUsbFSDma.u32BackgroundReadProtect));
        MODIFY_REG32(M4_MPU->HCR, MPU_UNIT_CONFIG_MASK,
                     (pstcMpuInit->stcUsbHSDma.u32ExceptionType          |
                      pstcMpuInit->stcUsbHSDma.u32BackgroundWriteProtect | pstcMpuInit->stcUsbHSDma.u32BackgroundReadProtect));
        MODIFY_REG32(M4_MPU->ECR, MPU_UNIT_CONFIG_MASK,
                     (pstcMpuInit->stcEthDma.u32ExceptionType            |
                      pstcMpuInit->stcEthDma.u32BackgroundWriteProtect   | pstcMpuInit->stcEthDma.u32BackgroundReadProtect));
    }

    return enRet;
}

/**
 * @brief  Fills each stc_mpu_init_t member with default value.
 * @param  [out] pstcMpuInit            Pointer to a @ref stc_mpu_init_t structure
 * @retval An en_result_t enumeration value:
 *           - Ok: stc_mpu_init_t member initialize success
 *           - ErrorInvalidParameter: Invalid parameter
 */
en_result_t MPU_StructInit(stc_mpu_init_t *pstcMpuInit)
{
    en_result_t enRet = Ok;

