RT-Thread/rt-thread/bsp/hc32f4a0/Libraries/HC32F4A0_StdPeriph_Driver/src/hc32f4a0_mpu.c
    if (NULL == pstcMpuInit)
    {
        enRet = ErrorInvalidParameter;
    }
    else
    {
        pstcMpuInit->stcDma1.u32ExceptionType              = MPU_EXP_TYPE_NONE;
        pstcMpuInit->stcDma2.u32ExceptionType              = MPU_EXP_TYPE_NONE;
        pstcMpuInit->stcUsbFSDma.u32ExceptionType          = MPU_EXP_TYPE_NONE;
        pstcMpuInit->stcUsbHSDma.u32ExceptionType          = MPU_EXP_TYPE_NONE;
        pstcMpuInit->stcEthDma.u32ExceptionType            = MPU_EXP_TYPE_NONE;
        pstcMpuInit->stcDma1.u32BackgroundWriteProtect     = MPU_BKGRD_WR_PROTECT_DISABLE;
        pstcMpuInit->stcDma2.u32BackgroundWriteProtect     = MPU_BKGRD_WR_PROTECT_DISABLE;
        pstcMpuInit->stcUsbFSDma.u32BackgroundWriteProtect = MPU_BKGRD_WR_PROTECT_DISABLE;
        pstcMpuInit->stcUsbHSDma.u32BackgroundWriteProtect = MPU_BKGRD_WR_PROTECT_DISABLE;
        pstcMpuInit->stcEthDma.u32BackgroundWriteProtect   = MPU_BKGRD_WR_PROTECT_DISABLE;
        pstcMpuInit->stcDma1.u32BackgroundReadProtect      = MPU_BKGRD_RD_PROTECT_DISABLE;
        pstcMpuInit->stcDma2.u32BackgroundReadProtect      = MPU_BKGRD_RD_PROTECT_DISABLE;
        pstcMpuInit->stcUsbFSDma.u32BackgroundReadProtect  = MPU_BKGRD_RD_PROTECT_DISABLE;
        pstcMpuInit->stcUsbHSDma.u32BackgroundReadProtect  = MPU_BKGRD_RD_PROTECT_DISABLE;
        pstcMpuInit->stcEthDma.u32BackgroundReadProtect    = MPU_BKGRD_RD_PROTECT_DISABLE;
    }

    return enRet;
}

/**
 * @brief  Set the exception type of the unit.
 * @param  [in] u32Unit                 The type of MPU unit.
 *         This parameter can be one or any combination of the following values:
 *           @arg MPU_UNIT_DMA1:        System DMA_1 MPU
 *           @arg MPU_UNIT_DMA2:        System DMA_2 MPU
 *           @arg MPU_UNIT_USBFS_DMA:   USBFS_DMA MPU
 *           @arg MPU_UNIT_USBHS_DMA:   USBHS_DMA MPU
 *           @arg MPU_UNIT_ETH_DMA:     ETH_DMA MPU
 * @param  [in] u32ExceptionType        Exception type of MPU unit.
 *         This parameter can be one of the following values:
 *           @arg MPU_EXP_TYPE_NONE:    The host unit access protection regions will be ignored
 *           @arg MPU_EXP_TYPE_BUS_ERR: The host unit access protection regions will be ignored and a bus error will be triggered
 *           @arg MPU_EXP_TYPE_NMI:     The host unit access protection regions will be ignored and a NMI interrupt will be triggered
 *           @arg MPU_EXP_TYPE_RST:     The host unit access protection regions will trigger the reset
 * @retval None
 */
void MPU_SetExceptionType(uint32_t u32Unit, uint32_t u32ExceptionType)
{
    __IO uint32_t *CR;
    uint32_t u32UnitPos = 0UL;
    uint32_t u32Temp;

    /* Check parameters */
    DDL_ASSERT(IS_MPU_UNLOCK());
    DDL_ASSERT(IS_MPU_UNIT(u32Unit));
    DDL_ASSERT(IS_MPU_EXP_TYPE(u32ExceptionType));

    u32Temp = u32Unit;
    while (0UL != u32Temp)
    {
        if (0UL != (u32Temp & 0x1UL))
        {
            CR = (__IO uint32_t *)MPU_CR(u32UnitPos);
            MODIFY_REG32(*CR, MPU_S1CR_SMPU1ACT, u32ExceptionType);
        }
        u32Temp >>= 1UL;
        u32UnitPos += 0x10U;
    }
}

/**
 * @brief  Enable or disable the write protection of the unit for background space.
 * @param  [in] u32Unit                 The type of MPU unit.
 *         This parameter can be one or any combination of the following values:
 *           @arg MPU_UNIT_DMA1:        System DMA_1 MPU
 *           @arg MPU_UNIT_DMA2:        System DMA_2 MPU
 *           @arg MPU_UNIT_USBFS_DMA:   USBFS_DMA MPU
 *           @arg MPU_UNIT_USBHS_DMA:   USBHS_DMA MPU
 *           @arg MPU_UNIT_ETH_DMA:     ETH_DMA MPU
 * @param  [in] enNewState              The function new state.
 *           @arg This parameter can be: Enable or Disable.
 * @retval None
 */
void MPU_BackgroundWriteProtectCmd(uint32_t u32Unit, en_functional_state_t enNewState)
{
    __IO uint32_t *CR;
    uint32_t u32UnitPos = 0UL;
    uint32_t u32Temp;

    /* Check parameters */
    DDL_ASSERT(IS_MPU_UNLOCK());
    DDL_ASSERT(IS_MPU_UNIT(u32Unit));
    DDL_ASSERT(IS_FUNCTIONAL_STATE(enNewState));

    u32Temp = u32Unit;
    while (0UL != u32Temp)
    {
        if (0UL != (u32Temp & 0x1UL))
        {
            CR = (__IO uint32_t *)MPU_CR(u32UnitPos);
            if (Disable != enNewState)
            {
                SET_REG32_BIT(*CR, MPU_S1CR_SMPU1BWP);
            }
            else
            {
                CLEAR_REG32_BIT(*CR, MPU_S1CR_SMPU1BWP);
            }
        }
        u32Temp >>= 1UL;
        u32UnitPos += 0x10U;
    }
}

/**
 * @brief  Enable or disable the read protection of the unit for background space.
 * @param  [in] u32Unit                 The type of MPU unit.
 *         This parameter can be one or any combination of the following values:
 *           @arg MPU_UNIT_DMA1:        System DMA_1 MPU
 *           @arg MPU_UNIT_DMA2:        System DMA_2 MPU
 *           @arg MPU_UNIT_USBFS_DMA:   USBFS_DMA MPU
 *           @arg MPU_UNIT_USBHS_DMA:   USBHS_DMA MPU
 *           @arg MPU_UNIT_ETH_DMA:     ETH_DMA MPU
 * @param  [in] enNewState              The function new state.
 *           @arg This parameter can be: Enable or Disable.
 * @retval None
 */
void MPU_BackgroundReadProtectCmd(uint32_t u32Unit, en_functional_state_t enNewState)
{
    __IO uint32_t *CR;
    uint32_t u32UnitPos = 0UL;
    uint32_t u32Temp;

    /* Check parameters */
    DDL_ASSERT(IS_MPU_UNLOCK());
    DDL_ASSERT(IS_MPU_UNIT(u32Unit));
    DDL_ASSERT(IS_FUNCTIONAL_STATE(enNewState));

    u32Temp = u32Unit;
    while (0UL != u32Temp)
    {
        if (0UL != (u32Temp & 0x1UL))
        {
            CR = (__IO uint32_t *)MPU_CR(u32UnitPos);
            if (Disable != enNewState)
            {
                SET_REG32_BIT(*CR, MPU_S1CR_SMPU1BRP);
            }
            else
            {
                CLEAR_REG32_BIT(*CR, MPU_S1CR_SMPU1BRP);
            }
        }
        u32Temp >>= 1UL;
        u32UnitPos += 0x10U;
    }
}

/**
 * @brief  Enable or disable the access control of the unit.
 * @param  [in] u32Unit                 The type of MPU unit.
 *         This parameter can be one or any combination of the following values:
 *           @arg MPU_UNIT_DMA1:        System DMA_1 MPU
 *           @arg MPU_UNIT_DMA2:        System DMA_2 MPU
 *           @arg MPU_UNIT_USBFS_DMA:   USBFS_DMA MPU
 *           @arg MPU_UNIT_USBHS_DMA:   USBHS_DMA MPU
 *           @arg MPU_UNIT_ETH_DMA:     ETH_DMA MPU
 * @param  [in] enNewState              The function new state.
 *           @arg This parameter can be: Enable or Disable.
 * @retval None
 */
void MPU_UnitCmd(uint32_t u32Unit, en_functional_state_t enNewState)
{
    __IO uint32_t *CR;
    uint32_t u32UnitPos = 0UL;
    uint32_t u32Temp;

    /* Check parameters */
    DDL_ASSERT(IS_MPU_UNLOCK());
    DDL_ASSERT(IS_MPU_UNIT(u32Unit));
    DDL_ASSERT(IS_FUNCTIONAL_STATE(enNewState));

    u32Temp = u32Unit;
    while (0UL != u32Temp)
    {
        if (0UL != (u32Temp & 0x1UL))
        {
            CR = (__IO uint32_t *)MPU_CR(u32UnitPos);
            if (Disable != enNewState)
            {
                SET_REG32_BIT(*CR, MPU_S1CR_SMPU1E);
            }
            else
            {
                CLEAR_REG32_BIT(*CR, MPU_S1CR_SMPU1E);
            }
        }
        u32Temp >>= 1UL;
        u32UnitPos += 0x10U;
    }
}

/**
 * @brief  Gets the status of MPU flag.
 * @param  [in] u32Flag                 The type of MPU flag.
 *         This parameter can be one or any combination of the following values:
 *           @arg MPU_FLAG_SMPU1EAF:    System DMA_1 error flag
 *           @arg MPU_FLAG_SMPU2EAF:    System DMA_2 error flag
 *           @arg MPU_FLAG_FMPUEAF:     USBFS_DMA error flag
 *           @arg MPU_FLAG_HMPUEAF:     USBHS_DMA error flag
 *           @arg MPU_FLAG_EMPUEAF:     ETH_DMA error flag
 *           @arg MPU_FLAG_ALL:         All of the above
 * @retval An en_flag_status_t enumeration value:
 *           - Set: Flag is set
 *           - Reset: Flag is reset
 */
en_flag_status_t MPU_GetStatus(uint32_t u32Flag)
{
    en_flag_status_t enFlagSta = Reset;

    /* Check parameters */
    DDL_ASSERT(IS_MPU_FLAG(u32Flag));

    if (0UL != (READ_REG32_BIT(M4_MPU->SR, u32Flag)))
    {
        enFlagSta = Set;
    }

