RT-Thread/rt-thread/bsp/hc32f4a0/Libraries/HC32F4A0_StdPeriph_Driver/src/hc32f4a0_mpu.c
    return enFlagSta;
}

/**
 * @brief  Clear the flag of MPU.
 * @param  [in] u32Flag                 The type of MPU flag.
 *         This parameter can be one or any combination of the following values:
 *           @arg MPU_FLAG_SMPU1EAF:    System DMA_1 error flag
 *           @arg MPU_FLAG_SMPU2EAF:    System DMA_2 error flag
 *           @arg MPU_FLAG_FMPUEAF:     USBFS_DMA error flag
 *           @arg MPU_FLAG_HMPUEAF:     USBHS_DMA error flag
 *           @arg MPU_FLAG_EMPUEAF:     ETH_DMA error flag
 *           @arg MPU_FLAG_ALL:         All of the above
 * @retval None
 */
void MPU_ClearStatus(uint32_t u32Flag)
{
    /* Check parameters */
    DDL_ASSERT(IS_MPU_FLAG(u32Flag));

    SET_REG32_BIT(M4_MPU->ECLR, u32Flag);
}

/**
 * @brief  Initialize the region.
 * @note   'MPU_REGION_NUM8' to 'MPU_REGION_NUM15' are only valid when the MPU unit is 'MPU_UNIT_DMA1' or 'MPU_UNIT_DMA2'.
 * @note   The effective bits of the 'u32BaseAddr' are related to the 'u32Size' of the region,
 *         and the low 'u32Size+1' bits are fixed at 0.
 * @param  [in] u32Num                  The number of the regsion.
 *         This parameter can be one of the following values:
 *           @arg MPU_REGION_NUM0:      MPU region number 0
 *           @arg MPU_REGION_NUM1:      MPU region number 1
 *           @arg MPU_REGION_NUM2:      MPU region number 2
 *           @arg MPU_REGION_NUM3:      MPU region number 3
 *           @arg MPU_REGION_NUM4:      MPU region number 4
 *           @arg MPU_REGION_NUM5:      MPU region number 5
 *           @arg MPU_REGION_NUM6:      MPU region number 6
 *           @arg MPU_REGION_NUM7:      MPU region number 7
 *           @arg MPU_REGION_NUM8:      MPU region number 8
 *           @arg MPU_REGION_NUM9:      MPU region number 9
 *           @arg MPU_REGION_NUM10:     MPU region number 10
 *           @arg MPU_REGION_NUM11:     MPU region number 11
 *           @arg MPU_REGION_NUM12:     MPU region number 12
 *           @arg MPU_REGION_NUM13:     MPU region number 13
 *           @arg MPU_REGION_NUM14:     MPU region number 14
 *           @arg MPU_REGION_NUM15:     MPU region number 15
 * @param  [in] pstcRegionInit          Pointer to a @ref stc_mpu_region_init_t structure
 * @retval An en_result_t enumeration value:
 *           - Ok: Initialize success
 *           - ErrorInvalidParameter: Invalid parameter
 */
en_result_t MPU_RegionInit(uint32_t u32Num, const stc_mpu_region_init_t *pstcRegionInit)
{
    en_result_t enRet = Ok;
    __IO uint32_t *RGD;
    __IO uint32_t *RGWP;
    __IO uint32_t *RGRP;
    uint32_t i;
    uint32_t u32UnitNum = MPU_UNIT_NUM;
    stc_mpu_region_permission_t RegionBuffer[MPU_UNIT_NUM];

    if (NULL == pstcRegionInit)
    {
        enRet = ErrorInvalidParameter;
    }
    else
    {
        /* Check parameters */
        DDL_ASSERT(IS_MPU_UNLOCK());
        DDL_ASSERT(IS_MPU_REGION(u32Num));
        DDL_ASSERT(IS_MPU_REGION_SIZE(pstcRegionInit->u32Size));
        DDL_ASSERT(IS_MPU_REGION_BASE_ADDER(pstcRegionInit->u32BaseAddr, pstcRegionInit->u32Size));
        DDL_ASSERT(IS_MPU_REGION_WR_PROTECT(pstcRegionInit->stcDma1.u32WriteProtect));
        DDL_ASSERT(IS_MPU_REGION_WR_PROTECT(pstcRegionInit->stcDma2.u32WriteProtect));
        DDL_ASSERT(IS_MPU_REGION_WR_PROTECT(pstcRegionInit->stcUsbFSDma.u32WriteProtect));
        DDL_ASSERT(IS_MPU_REGION_WR_PROTECT(pstcRegionInit->stcUsbHSDma.u32WriteProtect));
        DDL_ASSERT(IS_MPU_REGION_WR_PROTECT(pstcRegionInit->stcEthDma.u32WriteProtect));
        DDL_ASSERT(IS_MPU_REGION_RD_PROTECT(pstcRegionInit->stcDma1.u32ReadProtect));
        DDL_ASSERT(IS_MPU_REGION_RD_PROTECT(pstcRegionInit->stcDma2.u32ReadProtect));
        DDL_ASSERT(IS_MPU_REGION_RD_PROTECT(pstcRegionInit->stcUsbFSDma.u32ReadProtect));
        DDL_ASSERT(IS_MPU_REGION_RD_PROTECT(pstcRegionInit->stcUsbHSDma.u32ReadProtect));
        DDL_ASSERT(IS_MPU_REGION_RD_PROTECT(pstcRegionInit->stcEthDma.u32ReadProtect));

        RGD = (__IO uint32_t *)MPU_RGD(u32Num);
        WRITE_REG32(*RGD, (pstcRegionInit->u32Size | pstcRegionInit->u32BaseAddr));
        /* Configure the read/write permission for the region */
        RegionBuffer[0] = pstcRegionInit->stcDma1;
        RegionBuffer[1] = pstcRegionInit->stcDma2;
        RegionBuffer[2] = pstcRegionInit->stcUsbFSDma;
        RegionBuffer[3] = pstcRegionInit->stcUsbHSDma;
        RegionBuffer[4] = pstcRegionInit->stcEthDma;
        if ((u32Num >= MPU_REGION_NUM8) && (u32Num <= MPU_REGION_NUM15))
        {
            u32UnitNum = 2UL;
        }
        for (i = 0UL; i < u32UnitNum; i++)
        {
            /* Configure the write permission for the region */
            RGWP = (__IO uint32_t *)MPU_RGWP(i << 4);
            if (MPU_REGION_WR_PROTECT_DISABLE != RegionBuffer[i].u32WriteProtect)
            {
                SET_REG32_BIT(*RGWP, (0x1UL << u32Num));
            }
            else
            {
                CLEAR_REG32_BIT(*RGWP, (0x1UL << u32Num));
            }
            /* Configure the read permission for the region */
            RGRP = (__IO uint32_t *)MPU_RGRP(i << 4);
            if (MPU_REGION_WR_PROTECT_DISABLE != RegionBuffer[i].u32ReadProtect)
            {
                SET_REG32_BIT(*RGRP, (0x1UL << u32Num));
            }
            else
            {
                CLEAR_REG32_BIT(*RGRP, (0x1UL << u32Num));
            }
        }
    }

    return enRet;
}

/**
 * @brief  Fills each stc_mpu_region_init_t member with default value.
 * @param  [out] pstcRegionInit         Pointer to a @ref stc_mpu_region_init_t structure
 * @retval An en_result_t enumeration value:
 *           - Ok: stc_mpu_region_init_t member initialize success
 *           - ErrorInvalidParameter: Invalid parameter
 */
en_result_t MPU_RegionStructInit(stc_mpu_region_init_t *pstcRegionInit)
{
    en_result_t enRet = Ok;

    if (NULL == pstcRegionInit)
    {
        enRet = ErrorInvalidParameter;
    }
    else
    {
        pstcRegionInit->u32BaseAddr                 = 0UL;
        pstcRegionInit->u32Size                     = MPU_REGION_SIZE_32BYTE;
        pstcRegionInit->stcDma1.u32WriteProtect     = MPU_REGION_WR_PROTECT_DISABLE;
        pstcRegionInit->stcDma2.u32WriteProtect     = MPU_REGION_WR_PROTECT_DISABLE;
        pstcRegionInit->stcUsbFSDma.u32WriteProtect = MPU_REGION_WR_PROTECT_DISABLE;
        pstcRegionInit->stcUsbHSDma.u32WriteProtect = MPU_REGION_WR_PROTECT_DISABLE;
        pstcRegionInit->stcEthDma.u32WriteProtect   = MPU_REGION_WR_PROTECT_DISABLE;
        pstcRegionInit->stcDma1.u32ReadProtect      = MPU_REGION_RD_PROTECT_DISABLE;
        pstcRegionInit->stcDma2.u32ReadProtect      = MPU_REGION_RD_PROTECT_DISABLE;
        pstcRegionInit->stcUsbFSDma.u32ReadProtect  = MPU_REGION_RD_PROTECT_DISABLE;
        pstcRegionInit->stcUsbHSDma.u32ReadProtect  = MPU_REGION_RD_PROTECT_DISABLE;
        pstcRegionInit->stcEthDma.u32ReadProtect    = MPU_REGION_RD_PROTECT_DISABLE;
    }

    return enRet;
}

/**
 * @brief  Set the base address of the region.
 * @note   The effective bits of the 'u32Addr' are related to the 'size' of the region,
 *         and the low 'size+1' bits are fixed at 0.
 * @param  [in] u32Num                  The number of the regsion.
 *         This parameter can be one of the following values:
 *           @arg MPU_REGION_NUM0:      MPU region number 0
 *           @arg MPU_REGION_NUM1:      MPU region number 1
 *           @arg MPU_REGION_NUM2:      MPU region number 2
 *           @arg MPU_REGION_NUM3:      MPU region number 3
 *           @arg MPU_REGION_NUM4:      MPU region number 4
 *           @arg MPU_REGION_NUM5:      MPU region number 5
 *           @arg MPU_REGION_NUM6:      MPU region number 6
 *           @arg MPU_REGION_NUM7:      MPU region number 7
 *           @arg MPU_REGION_NUM8:      MPU region number 8
 *           @arg MPU_REGION_NUM9:      MPU region number 9
 *           @arg MPU_REGION_NUM10:     MPU region number 10
 *           @arg MPU_REGION_NUM11:     MPU region number 11
 *           @arg MPU_REGION_NUM12:     MPU region number 12
 *           @arg MPU_REGION_NUM13:     MPU region number 13
 *           @arg MPU_REGION_NUM14:     MPU region number 14
 *           @arg MPU_REGION_NUM15:     MPU region number 15
 * @param  [in] u32Addr                 The base address of the region.
 * @retval None
 */
void MPU_SetRegionBaseAddr(uint32_t u32Num, uint32_t u32Addr)
{
    __IO uint32_t *RGD;

    /* Check parameters */
    DDL_ASSERT(IS_MPU_UNLOCK());
    DDL_ASSERT(IS_MPU_REGION(u32Num));

    RGD = (__IO uint32_t *)MPU_RGD(u32Num);
    /* Check parameters */
    DDL_ASSERT(IS_MPU_REGION_BASE_ADDER(u32Addr, READ_REG32_BIT(*RGD, MPU_RGD_MPURGSIZE)));

    MODIFY_REG32(*RGD, MPU_RGD_MPURGADDR, u32Addr);
}

/**
 * @brief  Set the size of the region.
 * @param  [in] u32Num                  The number of the regsion.
 *         This parameter can be one of the following values:
 *           @arg MPU_REGION_NUM0:      MPU region number 0
 *           @arg MPU_REGION_NUM1:      MPU region number 1
 *           @arg MPU_REGION_NUM2:      MPU region number 2
 *           @arg MPU_REGION_NUM3:      MPU region number 3
 *           @arg MPU_REGION_NUM4:      MPU region number 4
 *           @arg MPU_REGION_NUM5:      MPU region number 5
 *           @arg MPU_REGION_NUM6:      MPU region number 6
 *           @arg MPU_REGION_NUM7:      MPU region number 7
 *           @arg MPU_REGION_NUM8:      MPU region number 8
 *           @arg MPU_REGION_NUM9:      MPU region number 9
 *           @arg MPU_REGION_NUM10:     MPU region number 10
 *           @arg MPU_REGION_NUM11:     MPU region number 11
 *           @arg MPU_REGION_NUM12:     MPU region number 12
 *           @arg MPU_REGION_NUM13:     MPU region number 13
 *           @arg MPU_REGION_NUM14:     MPU region number 14
 *           @arg MPU_REGION_NUM15:     MPU region number 15
 * @param  [in] u32Size                 The size of the region.
 *         This parameter can be one of the following values:
 *           @arg MPU_REGION_SIZE_32BYTE:       32 Byte
 *           @arg MPU_REGION_SIZE_64BYTE:       64 Byte
 *           @arg MPU_REGION_SIZE_128BYTE:      126 Byte
 *           @arg MPU_REGION_SIZE_256BYTE:      256 Byte
 *           @arg MPU_REGION_SIZE_512BYTE:      512 Byte
 *           @arg MPU_REGION_SIZE_1KBYTE:       1K Byte
 *           @arg MPU_REGION_SIZE_2KBYTE:       2K Byte
 *           @arg MPU_REGION_SIZE_4KBYTE:       4K Byte
 *           @arg MPU_REGION_SIZE_8KBYTE:       8K Byte
 *           @arg MPU_REGION_SIZE_16KBYTE:      16K Byte
 *           @arg MPU_REGION_SIZE_32KBYTE:      32K Byte
 *           @arg MPU_REGION_SIZE_64KBYTE:      64K Byte
 *           @arg MPU_REGION_SIZE_128KBYTE:     128K Byte
 *           @arg MPU_REGION_SIZE_256KBYTE:     256K Byte
 *           @arg MPU_REGION_SIZE_512KBYTE:     512K Byte
 *           @arg MPU_REGION_SIZE_1MBYTE:       1M Byte
 *           @arg MPU_REGION_SIZE_2MBYTE:       2M Byte
 *           @arg MPU_REGION_SIZE_4MBYTE:       4M Byte
 *           @arg MPU_REGION_SIZE_8MBYTE:       8M Byte
 *           @arg MPU_REGION_SIZE_16MBYTE:      16M Byte
 *           @arg MPU_REGION_SIZE_32MBYTE:      32M Byte
 *           @arg MPU_REGION_SIZE_64MBYTE:      64M Byte
 *           @arg MPU_REGION_SIZE_128MBYTE:     128M Byte
 *           @arg MPU_REGION_SIZE_256MBYTE:     256M Byte
 *           @arg MPU_REGION_SIZE_512MBYTE:     512M Byte
 *           @arg MPU_REGION_SIZE_1GBYTE:       1G Byte
 *           @arg MPU_REGION_SIZE_2GBYTE:       2G Byte
 *           @arg MPU_REGION_SIZE_4GBYTE:       4G Byte
 * @retval None
 */
void MPU_SetRegionSize(uint32_t u32Num, uint32_t u32Size)
{
    __IO uint32_t *RGD;

    /* Check parameters */
    DDL_ASSERT(IS_MPU_UNLOCK());
    DDL_ASSERT(IS_MPU_REGION(u32Num));
    DDL_ASSERT(IS_MPU_REGION_SIZE(u32Size));

    RGD = (__IO uint32_t *)MPU_RGD(u32Num);
    MODIFY_REG32(*RGD, MPU_RGD_MPURGSIZE, u32Size);
}

/**
 * @brief  Enable or disable the write protection of the unit for the region.
 * @note   'MPU_REGION_NUM8' to 'MPU_REGION_NUM15' are only valid when the MPU unit is 'MPU_UNIT_DMA1' or 'MPU_UNIT_DMA2'.
 * @param  [in] u32Num                  The number of the regsion.
 *         This parameter can be one of the following values:
 *           @arg MPU_REGION_NUM0:      MPU region number 0
 *           @arg MPU_REGION_NUM1:      MPU region number 1
 *           @arg MPU_REGION_NUM2:      MPU region number 2
 *           @arg MPU_REGION_NUM3:      MPU region number 3
 *           @arg MPU_REGION_NUM4:      MPU region number 4
 *           @arg MPU_REGION_NUM5:      MPU region number 5
 *           @arg MPU_REGION_NUM6:      MPU region number 6
 *           @arg MPU_REGION_NUM7:      MPU region number 7
 *           @arg MPU_REGION_NUM8:      MPU region number 8
 *           @arg MPU_REGION_NUM9:      MPU region number 9
 *           @arg MPU_REGION_NUM10:     MPU region number 10
 *           @arg MPU_REGION_NUM11:     MPU region number 11
 *           @arg MPU_REGION_NUM12:     MPU region number 12
 *           @arg MPU_REGION_NUM13:     MPU region number 13
 *           @arg MPU_REGION_NUM14:     MPU region number 14
 *           @arg MPU_REGION_NUM15:     MPU region number 15
 * @param  [in] u32Unit                 The type of MPU unit.
 *         This parameter can be one or any combination of the following values:
 *           @arg MPU_UNIT_DMA1:        System DMA_1 MPU
 *           @arg MPU_UNIT_DMA2:        System DMA_2 MPU
 *           @arg MPU_UNIT_USBFS_DMA:   USBFS_DMA MPU
 *           @arg MPU_UNIT_USBHS_DMA:   USBHS_DMA MPU
 *           @arg MPU_UNIT_ETH_DMA:     ETH_DMA MPU
 * @param  [in] enNewState              The function new state.
 *           @arg This parameter can be: Enable or Disable.
 * @retval None
 */
void MPU_RegionWriteProtectCmd(uint32_t u32Num, uint32_t u32Unit, en_functional_state_t enNewState)
{
    __IO uint32_t *RGWP;
    uint32_t u32UnitPos = 0UL;
    uint32_t u32Temp;

    /* Check parameters */
    DDL_ASSERT(IS_MPU_UNLOCK());
    DDL_ASSERT(IS_MPU_REGION(u32Num));
    DDL_ASSERT(IS_MPU_UNIT(u32Unit));
    DDL_ASSERT(IS_MPU_UNIT_REGION(u32Unit, u32Num));
    DDL_ASSERT(IS_FUNCTIONAL_STATE(enNewState));

    u32Temp = u32Unit;
    while (0UL != u32Temp)
    {
        if (0UL != (u32Temp & 0x1UL))
        {
            /* Configure the write permission for the region */
            RGWP = (__IO uint32_t *)MPU_RGWP(u32UnitPos);
            if (Disable != enNewState)
            {
                SET_REG32_BIT(*RGWP, (0x1UL << u32Num));
            }
            else
            {
                CLEAR_REG32_BIT(*RGWP, (0x1UL << u32Num));
            }
        }
        u32Temp >>= 1UL;
        u32UnitPos += 0x10U;
    }
}

/**
 * @brief  Enable or disable the read protection of the unit for the region.
 * @note   'MPU_REGION_NUM8' to 'MPU_REGION_NUM15' are only valid when the MPU unit is 'MPU_UNIT_DMA1' or 'MPU_UNIT_DMA2'.
 * @param  [in] u32Num                  The number of the regsion.
 *         This parameter can be one of the following values:
 *           @arg MPU_REGION_NUM0:      MPU region number 0
 *           @arg MPU_REGION_NUM1:      MPU region number 1
 *           @arg MPU_REGION_NUM2:      MPU region number 2
 *           @arg MPU_REGION_NUM3:      MPU region number 3
 *           @arg MPU_REGION_NUM4:      MPU region number 4
 *           @arg MPU_REGION_NUM5:      MPU region number 5
 *           @arg MPU_REGION_NUM6:      MPU region number 6
 *           @arg MPU_REGION_NUM7:      MPU region number 7
 *           @arg MPU_REGION_NUM8:      MPU region number 8
 *           @arg MPU_REGION_NUM9:      MPU region number 9
 *           @arg MPU_REGION_NUM10:     MPU region number 10
 *           @arg MPU_REGION_NUM11:     MPU region number 11
 *           @arg MPU_REGION_NUM12:     MPU region number 12
 *           @arg MPU_REGION_NUM13:     MPU region number 13
 *           @arg MPU_REGION_NUM14:     MPU region number 14
 *           @arg MPU_REGION_NUM15:     MPU region number 15
 * @param  [in] u32Unit                 The type of MPU unit.
 *         This parameter can be one or any combination of the following values:
 *           @arg MPU_UNIT_DMA1:        System DMA_1 MPU
 *           @arg MPU_UNIT_DMA2:        System DMA_2 MPU
 *           @arg MPU_UNIT_USBFS_DMA:   USBFS_DMA MPU
 *           @arg MPU_UNIT_USBHS_DMA:   USBHS_DMA MPU
 *           @arg MPU_UNIT_ETH_DMA:     ETH_DMA MPU
 * @param  [in] enNewState              The function new state.
 *           @arg This parameter can be: Enable or Disable.
 * @retval None
 */
void MPU_RegionReadProtectCmd(uint32_t u32Num, uint32_t u32Unit, en_functional_state_t enNewState)
{
    __IO uint32_t *RGRP;
    uint32_t u32UnitPos = 0UL;
    uint32_t u32Temp;

    /* Check parameters */
    DDL_ASSERT(IS_MPU_UNLOCK());
    DDL_ASSERT(IS_MPU_REGION(u32Num));
    DDL_ASSERT(IS_MPU_UNIT(u32Unit));
    DDL_ASSERT(IS_MPU_UNIT_REGION(u32Unit, u32Num));
    DDL_ASSERT(IS_FUNCTIONAL_STATE(enNewState));

    u32Temp = u32Unit;
    while (0UL != u32Temp)
    {
        if (0UL != (u32Temp & 0x1UL))
        {
            /* Configure the read permission for the region */
            RGRP = (__IO uint32_t *)MPU_RGRP(u32UnitPos);
            if (Disable != enNewState)
            {
                SET_REG32_BIT(*RGRP, (0x1UL << u32Num));
            }
            else
            {
                CLEAR_REG32_BIT(*RGRP, (0x1UL << u32Num));
            }
        }
        u32Temp >>= 1UL;
        u32UnitPos += 0x10U;
    }
}

/**
 * @brief  Enable or disable the access control of the unit for the region.
 * @note   'MPU_REGION_NUM8' to 'MPU_REGION_NUM15' are only valid when the MPU unit is 'MPU_UNIT_DMA1' or 'MPU_UNIT_DMA2'.
 * @param  [in] u32Num                  The number of the regsion.
 *         This parameter can be one of the following values:
 *           @arg MPU_REGION_NUM0:      MPU region number 0
 *           @arg MPU_REGION_NUM1:      MPU region number 1
 *           @arg MPU_REGION_NUM2:      MPU region number 2
 *           @arg MPU_REGION_NUM3:      MPU region number 3
 *           @arg MPU_REGION_NUM4:      MPU region number 4
 *           @arg MPU_REGION_NUM5:      MPU region number 5
 *           @arg MPU_REGION_NUM6:      MPU region number 6
 *           @arg MPU_REGION_NUM7:      MPU region number 7
 *           @arg MPU_REGION_NUM8:      MPU region number 8
 *           @arg MPU_REGION_NUM9:      MPU region number 9
 *           @arg MPU_REGION_NUM10:     MPU region number 10
 *           @arg MPU_REGION_NUM11:     MPU region number 11
 *           @arg MPU_REGION_NUM12:     MPU region number 12
 *           @arg MPU_REGION_NUM13:     MPU region number 13
 *           @arg MPU_REGION_NUM14:     MPU region number 14
 *           @arg MPU_REGION_NUM15:     MPU region number 15
 * @param  [in] u32Unit                 The type of MPU unit.
 *         This parameter can be one or any combination of the following values:
 *           @arg MPU_UNIT_DMA1:        System DMA_1 MPU
 *           @arg MPU_UNIT_DMA2:        System DMA_2 MPU
 *           @arg MPU_UNIT_USBFS_DMA:   USBFS_DMA MPU
 *           @arg MPU_UNIT_USBHS_DMA:   USBHS_DMA MPU
 *           @arg MPU_UNIT_ETH_DMA:     ETH_DMA MPU
 * @param  [in] enNewState              The function new state.
 *           @arg This parameter can be: Enable or Disable.
 * @retval None
 */
void MPU_RegionCmd(uint32_t u32Num, uint32_t u32Unit, en_functional_state_t enNewState)
{
    __IO uint32_t *RGE;
    uint32_t u32UnitPos = 0UL;
    uint32_t u32Temp;

    /* Check parameters */
    DDL_ASSERT(IS_MPU_UNLOCK());
    DDL_ASSERT(IS_MPU_REGION(u32Num));
    DDL_ASSERT(IS_MPU_UNIT(u32Unit));
    DDL_ASSERT(IS_MPU_UNIT_REGION(u32Unit, u32Num));
    DDL_ASSERT(IS_FUNCTIONAL_STATE(enNewState));

    u32Temp = u32Unit;
    while (0UL != u32Temp)
    {
        if (0UL != (u32Temp & 0x1UL))
        {
            RGE = (__IO uint32_t *)MPU_RGE(u32UnitPos);
            if (Disable != enNewState)
            {
                SET_REG32_BIT(*RGE, (0x1UL << u32Num));
            }
            else
            {
                CLEAR_REG32_BIT(*RGE, (0x1UL << u32Num));
            }
        }
        u32Temp >>= 1UL;
        u32UnitPos += 0x10U;
    }
}

/**
 * @brief  Set the type of exception to access the protected IP.
 * @param  [in] u32ExceptionType                Exception type of MPU IP.
 *         This parameter can be one of the following values:
 *           @arg MPU_IP_EXP_TYPE_NONE:         Access to the protected IP will be ignored
 *           @arg MPU_IP_EXP_TYPE_BUS_ERR:      Access to the protected IP will trigger a bus error
 * @retval None
 */
void MPU_IP_SetExceptionType(uint32_t u32ExceptionType)
{
    /* Check parameters */
    DDL_ASSERT(IS_MPU_UNLOCK());
    DDL_ASSERT(IS_MPU_IP_EXP_TYPE(u32ExceptionType));

    WRITE_REG32(bM4_MPU->IPPR_b.BUSERRE, (u32ExceptionType >> MPU_IPPR_BUSERRE_POS));
}

/**
 * @brief  Enable or disable write protection for the IP.
 * @param  [in] u32Peripheral           The peripheral of the chip.
 *         This parameter can be one or any combination of the following values:
 *           @arg MPU_IP_AES:           AES module
 *           @arg MPU_IP_HASH:          HASH module
 *           @arg MPU_IP_TRNG:          TRNG module
 *           @arg MPU_IP_CRC:           CRC module
 *           @arg MPU_IP_FMC:           FMC module
 *           @arg MPU_IP_WDT:           WDT module
 *           @arg MPU_IP_SWDT:          SWDT module
 *           @arg MPU_IP_BKSRAM:        BKSRAM module
 *           @arg MPU_IP_RTC:           RTC module
 *           @arg MPU_IP_DMPU:          DMPU module
 *           @arg MPU_IP_SRAMC:         SRAMC module
 *           @arg MPU_IP_INTC:          INTC module
 *           @arg MPU_IP_SYSC:          SYSC module
 *           @arg MPU_IP_MSTP:          MSTP module
 *           @arg MPU_IP_ALL:           All of the above
 * @param  [in] enNewState              The function new state.
 *           @arg This parameter can be: Enable or Disable.
 * @retval None
 */
void MPU_IP_WriteProtectCmd(uint32_t u32Peripheral, en_functional_state_t enNewState)
{
    /* Check parameters */
    DDL_ASSERT(IS_MPU_UNLOCK());
    DDL_ASSERT(IS_MPU_IP_TYPE(u32Peripheral));
    DDL_ASSERT(IS_FUNCTIONAL_STATE(enNewState));

