RT-Thread/rt-thread/bsp/hc32f4a0/Libraries/HC32F4A0_StdPeriph_Driver/src/hc32f4a0_mpu.c
    if (Disable != enNewState)
    {
        SET_REG32_BIT(M4_MPU->IPPR, (u32Peripheral << 1U));
    }
    else
    {
        CLEAR_REG32_BIT(M4_MPU->IPPR, (u32Peripheral << 1U));
    }
}

/**
 * @brief  Enable or disable read protection for the IP.
 * @param  [in] u32Peripheral           The peripheral of the chip.
 *         This parameter can be one or any combination of the following values:
 *           @arg MPU_IP_AES:           AES module
 *           @arg MPU_IP_HASH:          HASH module
 *           @arg MPU_IP_TRNG:          TRNG module
 *           @arg MPU_IP_CRC:           CRC module
 *           @arg MPU_IP_FMC:           FMC module
 *           @arg MPU_IP_WDT:           WDT module
 *           @arg MPU_IP_SWDT:          SWDT module
 *           @arg MPU_IP_BKSRAM:        BKSRAM module
 *           @arg MPU_IP_RTC:           RTC module
 *           @arg MPU_IP_DMPU:          DMPU module
 *           @arg MPU_IP_SRAMC:         SRAMC module
 *           @arg MPU_IP_INTC:          INTC module
 *           @arg MPU_IP_SYSC:          SYSC module
 *           @arg MPU_IP_MSTP:          MSTP module
 *           @arg MPU_IP_ALL:           All of the above
 * @param  [in] enNewState              The function new state.
 *           @arg This parameter can be: Enable or Disable.
 * @retval None
 */
void MPU_IP_ReadProtectCmd(uint32_t u32Peripheral, en_functional_state_t enNewState)
{
    /* Check parameters */
    DDL_ASSERT(IS_MPU_UNLOCK());
    DDL_ASSERT(IS_MPU_IP_TYPE(u32Peripheral));
    DDL_ASSERT(IS_FUNCTIONAL_STATE(enNewState));

    if (Disable != enNewState)
    {
        SET_REG32_BIT(M4_MPU->IPPR, u32Peripheral);
    }
    else
    {
        CLEAR_REG32_BIT(M4_MPU->IPPR, u32Peripheral);
    }
}

/**
 * @}
 */

#endif /* DDL_MPU_ENABLE */

/**
 * @}
 */

/**
* @}
*/

/******************************************************************************
 * EOF (not truncated)
 *****************************************************************************/
